tylertms/dspic33e-sim/conformance/pwm.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} PwmConformance;

static const uint8_t irqs[DSPIC33_PWM_COUNT] = {94u, 95u, 96u, 97u, 98u, 99u};

static uint16_t base(uint8_t generator) {
    return (uint16_t)(0x0c20u + generator * 0x20u);
}

static void expect(PwmConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[pwm-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void configure_generator(Dspic33* cpu, uint8_t generator, uint16_t mode,
                                uint16_t period, uint16_t duty, uint16_t control) {
    uint16_t address = base(generator);
    dspic33_write_word(cpu, 0x0c00u, 0u);
    dspic33_write_word(cpu, 0x0c02u, 1u);
    dspic33_write_word(cpu, 0x0c04u, period);
    dspic33_write_word(cpu, (uint16_t)(address + 6u), duty);
    dspic33_write_word(cpu, (uint16_t)(address + 0x0eu), duty);
    dspic33_write_word(cpu, (uint16_t)(address + 2u), (uint16_t)(0xc000u | mode));
    dspic33_write_word(cpu, address, control);
}

static void enable_pwm(Dspic33* cpu, uint16_t control) {
    dspic33_write_word(cpu, 0x0c00u, (uint16_t)(control | 0x8000u));
}

static void register_cases(PwmConformance* state, Dspic33* cpu) {
    static const uint16_t offsets[] = {0x00u, 0x02u, 0x04u, 0x06u, 0x08u, 0x0au,
                                       0x0cu, 0x0eu, 0x10u, 0x12u, 0x14u, 0x16u,
                                       0x18u, 0x1au, 0x1cu, 0x1eu};
    static const uint16_t masks[] = {
        0x1fefu, 0xffffu, 0xffffu, 0xffffu, 0xffffu, 0x3fffu, 0x3fffu, 0xffffu,
        0xffffu, 0xffffu, 0xf03fu, 0x0000u, 0x0000u, 0xfc3fu, 0x0fffu, 0x0f3fu};
    uint8_t generator;
    uint8_t index;
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0c04u) == 0xffffu, "primary period reset");
    expect(state, dspic33_read_word(cpu, 0x0c12u) == 0xffffu, "secondary period reset");
    dspic33_write_word(cpu, 0x0c06u, 1u);
    dspic33_write_word(cpu, 0x0c14u, 1u);
    dspic33_write_word(cpu, 0x0c00u, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0c00u) == 0xafffu, "primary control mask");
    dspic33_write_word(cpu, 0x0c00u, 0u);
    dspic33_write_word(cpu, 0x0c02u, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0c02u) == 0x0007u, "primary divider mask");
    dspic33_write_word(cpu, 0x0c0eu, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0c0eu) == 0x0fffu, "secondary control mask");
    dspic33_write_word(cpu, 0x0c10u, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0c10u) == 0x0007u, "secondary divider mask");
    dspic33_write_word(cpu, 0x0c1au, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0c1au) == 0x83ffu, "chop mask");
    for (generator = 0u; generator < DSPIC33_PWM_COUNT; generator++) {
        for (index = 0u; index < sizeof(offsets) / sizeof(offsets[0]); index++) {
            uint16_t address = (uint16_t)(base(generator) + offsets[index]);
            dspic33_write_word(cpu, address, 0xffffu);
            expect(state, dspic33_read_word(cpu, address) == masks[index],
                   "generator register mask");
            dspic33_write_word(cpu, address, 0u);
        }
    }
}

static void clock_cases(PwmConformance* state, Dspic33* cpu) {
    uint8_t divider;
    for (divider = 0u; divider < 7u; divider++) {
        uint16_t expected_ticks = divider == 0u ? 2u : divider == 1u ? 1u : 0u;
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, 0u, 0u, 100u, 0u, 0x0080u);
        dspic33_write_word(cpu, 0x0c02u, divider);
        enable_pwm(cpu, 0u);
        dspic33_device_advance(cpu, 1u);
        expect(state, cpu->io.pwm_master_counter[0] == expected_ticks,
               "primary divider first cycle");
        if (divider >= 2u) {
            uint16_t cycles = (uint16_t)(1u << (divider - 1u));
            dspic33_device_advance(cpu, (uint16_t)(cycles - 1u));
            expect(state, cpu->io.pwm_master_counter[0] == 1u,
                   "primary divider accumulated cycle");
        }
    }
    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 9u, 5u, 0x0080u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c02u, 6u);
    expect(state, dspic33_read_word(cpu, 0x0c02u) == 1u,
           "divider locked while enabled");

    for (divider = 0u; divider < 7u; divider++) {
        uint16_t expected_ticks = divider == 0u ? 2u : divider == 1u ? 1u : 0u;
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, 0u, 0u, 100u, 0u, 0x0088u);
        dspic33_write_word(cpu, 0x0c12u, 100u);
        dspic33_write_word(cpu, 0x0c10u, divider);
        enable_pwm(cpu, 0u);
        dspic33_device_advance(cpu, 1u);
        expect(state, cpu->io.pwm_master_counter[1] == expected_ticks,
               "secondary divider first cycle");
        if (divider >= 2u) {
            uint16_t cycles = (uint16_t)(1u << (divider - 1u));
            dspic33_device_advance(cpu, (uint16_t)(cycles - 1u));
            expect(state, cpu->io.pwm_master_counter[1] == 1u,
                   "secondary divider accumulated cycle");
        }
    }
}

static void mode_cases(PwmConformance* state, Dspic33* cpu) {
    static const uint16_t modes[] = {0x0000u, 0x0400u, 0x0800u, 0x0c00u};
    uint8_t mode;
    for (mode = 0u; mode < sizeof(modes) / sizeof(modes[0]); mode++) {
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, 0u, modes[mode], 7u, 3u, 0x0080u);
        if (mode == 3u) {
            dspic33_write_word(cpu, 0x0c2eu, 1u);
        }
        enable_pwm(cpu, 0u);
        expect(state, dspic33_pwm_output(cpu, 0u, true), "mode initial high output");
        expect(state, dspic33_pwm_output(cpu, 0u, false) == (mode == 1u || mode == 3u),
               "mode initial low output");
        dspic33_device_advance(cpu, 4u);
        expect(state, !dspic33_pwm_output(cpu, 0u, true), "mode inactive high output");
        expect(state, dspic33_pwm_output(cpu, 0u, false) == (mode == 0u),
               "mode inactive low output");
    }

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c22u, 0xf3c0u);
    enable_pwm(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "override polarity high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "override polarity low");
    dspic33_write_word(cpu, 0x0c22u, 0xc3c0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "override high data");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "override low data");
    dspic33_write_word(cpu, 0x0c22u, 0xc382u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "swap high output");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "swap low output");
    dspic33_write_word(cpu, 0x0c22u, 0x0200u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "unowned high pin");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "unowned low pin");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0800u, 3u, 3u, 0x0080u);
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "push-pull first high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "push-pull first low");
    dspic33_device_advance(cpu, 4u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "push-pull second high");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "push-pull second low");
}

