tylertms/dspic33e-sim/conformance/pwm.c
static void duty_cases(PwmConformance* state, Dspic33* cpu) {
    uint8_t generator;
    uint16_t duty;
    for (generator = 0u; generator < DSPIC33_PWM_COUNT; generator++) {
        for (duty = 0u; duty <= 8u; duty++) {
            dspic33_reset(cpu, 0u);
            configure_generator(cpu, generator, 0x0400u, 7u, duty, 0x0080u);
            enable_pwm(cpu, 0u);
            expect(state, dspic33_pwm_output(cpu, generator, true),
                   "duty starts asserted");
            dspic33_device_advance(cpu, 4u);
            expect(state, dspic33_pwm_output(cpu, generator, true) == (duty >= 4u),
                   "duty boundary output");
        }
    }

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 1u, 0x0180u);
    dspic33_write_word(cpu, 0x0c0au, 6u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 3u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "master duty selection");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0c00u, 7u, 7u, 0x0284u);
    dspic33_write_word(cpu, 0x0c28u, 3u);
    dspic33_write_word(cpu, 0x0c2eu, 1u);
    dspic33_write_word(cpu, 0x0c30u, 2u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 1u);
    expect(state, cpu->io.pwm_counter[0][0] == 1u, "independent center counter up");
    dspic33_device_advance(cpu, 2u);
    expect(state, cpu->io.pwm_counter[0][0] == 3u, "independent center peak");
    dspic33_device_advance(cpu, 3u);
    expect(state, cpu->io.pwm_counter[0][0] == 0u, "independent center counter down");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0c00u, 7u, 1u, 0x0080u);
    dspic33_write_word(cpu, 0x0c28u, 2u);
    dspic33_write_word(cpu, 0x0c30u, 4u);
    enable_pwm(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "phase-shifted high idle");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "phase-shifted low idle");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "phase-shifted high start");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "phase-shifted low wait");
    dspic33_device_advance(cpu, 2u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "phase-shifted high end");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "phase-shifted low start");
}

static void update_cases(PwmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c26u, 1u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 7u, "deferred duty update");
    dspic33_device_advance(cpu, 8u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 1u, "boundary duty update");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0081u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c26u, 2u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 2u, "immediate duty update");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    expect(state, cpu->io.pwm_active_period[0] == 7u, "deferred period update");
    dspic33_write_word(cpu, 0x0c00u, 0x8400u);
    dspic33_write_word(cpu, 0x0c04u, 5u);
    expect(state, cpu->io.pwm_active_period[0] == 5u, "immediate period update");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0c00u, 7u, 1u, 0x0080u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c28u, 2u);
    expect(state, cpu->io.pwm_active_phase[0][0] == 0u, "deferred phase update");
    dspic33_device_advance(cpu, 8u);
    expect(state, cpu->io.pwm_active_phase[0][0] == 2u, "boundary phase update");
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "boundary phase output");
}

static uint16_t active_timing_value(const Dspic33* cpu, uint8_t generator,
                                    uint16_t offset) {
    switch (offset) {
    case 6u:
        return cpu->io.pwm_active_duty[generator][0];
    case 8u:
        return cpu->io.pwm_active_phase[generator][0];
    case 0x0au:
        return cpu->io.pwm_active_dead_time[generator][0];
    case 0x0cu:
        return cpu->io.pwm_active_dead_time[generator][1];
    case 0x0eu:
        return cpu->io.pwm_active_duty[generator][1];
    case 0x10u:
        return cpu->io.pwm_active_phase[generator][1];
    default:
        return UINT16_MAX;
    }
}

static void b1_update_cases(PwmConformance* state, Dspic33* cpu) {
    static const uint16_t timing_offsets[] = {6u, 8u, 0x0au, 0x0cu, 0x0eu, 0x10u};
    Dspic33 copy;
    bool initialized;
    uint8_t generator;
    uint8_t index;
    for (generator = 0u; generator < DSPIC33_PWM_COUNT; generator++) {
        uint16_t address = base(generator);
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, generator, 0x0400u, 7u, 6u, 0x0080u);
        enable_pwm(cpu, 0u);
        if ((generator & 1u) == 0u) {
            dspic33_write_word(cpu, 0x0c04u, 3u);
            dspic33_write_word(cpu, (uint16_t)(address + 6u), 1u);
        } else {
            dspic33_write_word(cpu, (uint16_t)(address + 6u), 1u);
            dspic33_write_word(cpu, 0x0c04u, 3u);
        }
        dspic33_device_advance(cpu, 8u);
        expect(state, cpu->io.pwm_active_period[0] == 3u,
               "B1 primary period updates at first boundary");
        expect(state, cpu->io.pwm_active_duty[generator][0] == 6u,
               "B1 primary duty waits after period update");
        dspic33_device_advance(cpu, 4u);
        expect(state, cpu->io.pwm_active_duty[generator][0] == 1u,
               "B1 primary duty updates at second boundary");
    }

    for (index = 0u; index < sizeof(timing_offsets) / sizeof(timing_offsets[0]);
         index++) {
        uint16_t offset = timing_offsets[index];
        uint16_t previous = offset == 6u || offset == 0x0eu ? 6u : 0u;
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, 0u, 0x0400u, 7u, 6u, 0x0080u);
        enable_pwm(cpu, 0u);
        dspic33_write_word(cpu, 0x0c04u, 3u);
        dspic33_write_word(cpu, (uint16_t)(base(0u) + offset), 2u);
        dspic33_device_advance(cpu, 8u);
        expect(state, active_timing_value(cpu, 0u, offset) == previous,
               "B1 timing register waits after period update");
        dspic33_device_advance(cpu, 4u);
        expect(state, active_timing_value(cpu, 0u, offset) == 2u,
               "B1 timing register updates one cycle later");
    }

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 6u, 0x0088u);
    dspic33_write_word(cpu, 0x0c12u, 7u);
    dspic33_write_word(cpu, 0x0c10u, 1u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c12u, 3u);
    dspic33_write_word(cpu, 0x0c26u, 1u);
    dspic33_device_advance(cpu, 8u);
    expect(state, cpu->io.pwm_active_period[1] == 3u,
           "B1 secondary period updates at first boundary");
    expect(state, cpu->io.pwm_active_duty[0][0] == 6u,
           "B1 secondary duty waits after period update");
    dspic33_device_advance(cpu, 4u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 1u,
           "B1 secondary duty updates at second boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 1u, 0x0180u);
    dspic33_write_word(cpu, 0x0c0au, 6u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    dspic33_write_word(cpu, 0x0c0au, 1u);
    dspic33_device_advance(cpu, 8u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 6u,
           "B1 master duty waits after period update");
    dspic33_device_advance(cpu, 4u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 1u,
           "B1 master duty updates at second boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 6u, 0x0280u);
    dspic33_write_word(cpu, 0x0c28u, 7u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    dspic33_write_word(cpu, 0x0c26u, 1u);
    dspic33_device_advance(cpu, 8u);
    expect(state, cpu->io.pwm_active_duty[0][0] == 1u,
           "B1 independent timing ignores master period delay");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 6u, 0x0081u);
    enable_pwm(cpu, 0x0400u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    dspic33_write_word(cpu, 0x0c26u, 1u);
    expect(state,
           cpu->io.pwm_active_period[0] == 3u && cpu->io.pwm_active_duty[0][0] == 1u,
           "B1 immediate period and duty bypass delay");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 6u, 0x00c0u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    expect(state, dspic33_pwm_dead_time(cpu, 0u, true, 0u),
           "schedule B1 delayed compensation signal");
    dspic33_device_advance(cpu, 0u);
    dspic33_device_advance(cpu, 8u);
    expect(state, (cpu->io.pwm_dead_time_sampled & 1u) == 0u,
           "B1 compensation signal waits after period update");
    dspic33_device_advance(cpu, 4u);
    expect(state, (cpu->io.pwm_dead_time_sampled & 1u) != 0u,
           "B1 compensation signal updates at second boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((2u << 3u) | 1u));
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_fault(cpu, 2u, true, 0u),
           "schedule B1 cycle fault assertion");
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_fault(cpu, 2u, false, 0u),
           "schedule B1 cycle fault release");
    dspic33_device_advance(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    dspic33_device_advance(cpu, 8u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "B1 cycle fault release waits after period update");
    dspic33_device_advance(cpu, 4u);
    expect(state, dspic33_pwm_output(cpu, 0u, true),
           "B1 cycle fault releases at second boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((3u << 10u) | 0x0100u));
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_current_limit(cpu, 3u, true, 0u),
           "schedule B1 current-limit assertion");
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_current_limit(cpu, 3u, false, 0u),
           "schedule B1 current-limit release");
    dspic33_device_advance(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    dspic33_device_advance(cpu, 8u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "B1 current-limit release waits after period update");
    dspic33_device_advance(cpu, 4u);
    expect(state, dspic33_pwm_output(cpu, 0u, true),
           "B1 current-limit releases at second boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 6u, 0x0080u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c04u, 3u);
    dspic33_write_word(cpu, 0x0c26u, 1u);
    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize B1 PWM update copy");
    if (initialized) {
        expect(state, dspic33_copy(&copy, cpu), "copy B1 PWM update state");
        dspic33_device_advance(cpu, 8u);
        dspic33_device_advance(&copy, 8u);
        expect(state,
               copy.io.pwm_active_period[0] == cpu->io.pwm_active_period[0] &&
                   copy.io.pwm_active_duty[0][0] == cpu->io.pwm_active_duty[0][0],
               "copied B1 PWM first boundary");
        dspic33_device_advance(cpu, 4u);
        dspic33_device_advance(&copy, 4u);
        expect(state, copy.io.pwm_active_duty[0][0] == cpu->io.pwm_active_duty[0][0],
               "copied B1 PWM second boundary");
        dspic33_destroy(&copy);
    }
    dspic33_reset(cpu, 0u);
    expect(state, cpu->io.pwm_period_update == 0u && cpu->io.pwm_timing_update == 0u,
           "reset B1 PWM update state");
}

static void trigger_cases(PwmConformance* state, Dspic33* cpu) {
    uint8_t generator;
    uint8_t divider;
    for (generator = 0u; generator < DSPIC33_PWM_COUNT; generator++) {
        for (divider = 0u; divider < 4u; divider++) {
            uint16_t address = base(generator);
            uint8_t match;
            dspic33_reset(cpu, 0u);
            configure_generator(cpu, generator, 0x0400u, 3u, 1u, 0x0480u);
            dspic33_write_word(cpu, (uint16_t)(address + 0x12u), 1u);
            dspic33_write_word(cpu, (uint16_t)(address + 0x14u),
                               (uint16_t)(divider << 12u));
            enable_pwm(cpu, 0u);
            for (match = 0u; match <= divider; match++) {
                dspic33_device_advance(cpu, match == 0u ? 1u : 4u);
                expect(state,
                       interrupt_flag(cpu, irqs[generator]) == (match == divider),
                       "generator trigger divider");
            }
            expect(state, (dspic33_read_word(cpu, address) & 0x2000u) != 0u,
                   "generator trigger status");
            dspic33_write_word(cpu, address, 0x0080u);
            expect(state, (dspic33_read_word(cpu, address) & 0x2000u) == 0u,
                   "generator trigger status clear");
        }
    }

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 3u, 1u, 0x0480u);
    dspic33_write_word(cpu, 0x0c32u, 1u);
    dspic33_write_word(cpu, 0x0c34u, 2u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 5u);
    expect(state, !interrupt_flag(cpu, 94u), "trigger start delay");
    dspic33_device_advance(cpu, 4u);
    expect(state, interrupt_flag(cpu, 94u), "trigger after start delay");

    for (divider = 0u; divider < 4u; divider++) {
        uint8_t match;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0c02u, 1u);
        dspic33_write_word(cpu, 0x0c04u, 3u);
        dspic33_write_word(cpu, 0x0c06u, 1u);
        enable_pwm(cpu, (uint16_t)(0x0800u | divider));
        for (match = 0u; match <= divider; match++) {
            dspic33_device_advance(cpu, match == 0u ? 1u : 4u);
            expect(state, interrupt_flag(cpu, 57u) == (match == divider),
                   "special event divider");
        }
        expect(state, (dspic33_read_word(cpu, 0x0c00u) & 0x1000u) != 0u,
               "special event status");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0c02u, 1u);
    dspic33_write_word(cpu, 0x0c04u, 7u);
    dspic33_write_word(cpu, 0x0c0eu, 0x0800u);
    dspic33_write_word(cpu, 0x0c12u, 3u);
    dspic33_write_word(cpu, 0x0c14u, 2u);
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 2u);
    expect(state, interrupt_flag(cpu, 73u), "secondary special event interrupt");
    expect(state, (dspic33_read_word(cpu, 0x0c0eu) & 0x1000u) != 0u,
           "secondary special event status");
}

static void protection_cases(PwmConformance* state, Dspic33* cpu) {
    uint8_t generator;
    for (generator = 0u; generator < DSPIC33_PWM_COUNT; generator++) {
        uint16_t address = base(generator);
        dspic33_reset(cpu, 0u);
        configure_generator(cpu, generator, 0x0400u, 7u, 7u, 0x1080u);
        dspic33_write_word(cpu, (uint16_t)(address + 4u), (uint16_t)(2u << 3u));
        enable_pwm(cpu, 0u);
        expect(state, dspic33_pwm_fault(cpu, 2u, true, 0u), "schedule PWM fault");
        dspic33_device_advance(cpu, 0u);
        expect(state, !dspic33_pwm_output(cpu, generator, true),
               "latched fault output");
        expect(state, interrupt_flag(cpu, irqs[generator]), "latched fault interrupt");
        expect(state, (dspic33_read_word(cpu, address) & 0x8000u) != 0u,
               "latched fault status");
        dspic33_pwm_fault(cpu, 2u, false, 0u);
        dspic33_device_advance(cpu, 0u);
        dspic33_write_word(cpu, address, 0x0080u);
        dspic33_device_advance(cpu, 8u);
        expect(state, dspic33_pwm_output(cpu, generator, true),
               "latched fault release");
    }

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0880u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((3u << 10u) | 0x0100u));
    enable_pwm(cpu, 0u);
    dspic33_pwm_current_limit(cpu, 3u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "current-limit output");
    expect(state, interrupt_flag(cpu, 94u), "current-limit interrupt");
    expect(state, (dspic33_read_word(cpu, 0x0c20u) & 0x4000u) != 0u,
           "current-limit status");
    expect(state, dspic33_read_word(cpu, 0x0c38u) == 0u, "current-limit time capture");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((4u << 3u) | 0x0005u));
    enable_pwm(cpu, 0u);
    dspic33_pwm_fault(cpu, 4u, false, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "active-low fault");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0282u);
    dspic33_write_word(cpu, 0x0c28u, 7u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)(5u << 10u));
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 3u);
    dspic33_pwm_current_limit(cpu, 5u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, cpu->io.pwm_counter[0][0] == 0u, "current reset time base");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((6u << 3u) | 1u));
    dspic33_write_word(cpu, 0x0c3au, 0x8800u);
    dspic33_write_word(cpu, 0x0c3cu, 4u);
    enable_pwm(cpu, 0u);
    dspic33_pwm_fault(cpu, 6u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "leading-edge fault blanking");
    dspic33_device_advance(cpu, 4u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "fault after blanking");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    configure_generator(cpu, 1u, 0x0400u, 7u, 1u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((6u << 3u) | 1u));
    dspic33_write_word(cpu, 0x0c3au, 0x0820u);
    dspic33_write_word(cpu, 0x0c3eu, 0x0200u);
    enable_pwm(cpu, 0u);
    dspic33_pwm_fault(cpu, 6u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "state blanked fault");
    dspic33_device_advance(cpu, 2u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "state blanking end");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((6u << 3u) | 1u));
    dspic33_write_word(cpu, 0x0c3au, 0x0820u);
    dspic33_write_word(cpu, 0x0c3eu, 0x0700u);
    enable_pwm(cpu, 0u);
    dspic33_pwm_fault(cpu, 6u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "reserved state blank source");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((2u << 3u) | 1u));
    enable_pwm(cpu, 0u);
    dspic33_pwm_fault(cpu, 2u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    dspic33_pwm_fault(cpu, 2u, false, 0u);
    dspic33_device_advance(cpu, 7u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "cycle fault held before boundary");
    dspic33_device_advance(cpu, 1u);
    expect(state, dspic33_pwm_output(cpu, 0u, true),
           "cycle fault released at boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x0080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((3u << 10u) | 0x0100u));
    enable_pwm(cpu, 0u);
    dspic33_pwm_current_limit(cpu, 3u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    dspic33_pwm_current_limit(cpu, 3u, false, 0u);
    dspic33_device_advance(cpu, 7u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "current limit held before boundary");
    dspic33_device_advance(cpu, 1u);
    expect(state, dspic33_pwm_output(cpu, 0u, true),
           "current limit released at boundary");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 7u, 0x1080u);
    dspic33_write_word(cpu, 0x0c24u, (uint16_t)((2u << 3u) | 3u));
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 3u);
    dspic33_pwm_fault(cpu, 2u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "disabled fault output");
    expect(state, interrupt_flag(cpu, 94u), "disabled fault interrupt");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 1u, 0x0080u);
    dspic33_write_word(cpu, 0x0c22u, 0xc40cu);
    dspic33_write_word(cpu, 0x0c24u,
                       (uint16_t)((3u << 10u) | 0x0100u | (2u << 3u) | 1u));
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 3u);
    dspic33_pwm_current_limit(cpu, 3u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "current-limit high data");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "current-limit low data");
    dspic33_pwm_fault(cpu, 2u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "fault priority high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "fault priority low");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 7u, 1u, 0x0080u);
    dspic33_write_word(cpu, 0x0c22u, 0xc430u);
    dspic33_write_word(cpu, 0x0c24u,
                       (uint16_t)(0x8000u | (3u << 10u) | 0x0100u | (2u << 3u) | 1u));
    enable_pwm(cpu, 0u);
    dspic33_device_advance(cpu, 3u);
    dspic33_pwm_current_limit(cpu, 3u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "independent current high");
    expect(state, !dspic33_pwm_output(cpu, 0u, false), "independent current low");
    dspic33_pwm_fault(cpu, 2u, true, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "independent fault high");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "independent fault low");
}

static void synchronization_cases(PwmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 15u, 7u, 0x0080u);
    enable_pwm(cpu, 0x0080u);
    dspic33_device_advance(cpu, 5u);
    expect(state, cpu->io.pwm_master_counter[0] == 5u, "counter before sync");
    expect(state, dspic33_pwm_sync(cpu, 0u, true, 0u), "schedule PWM sync");
    dspic33_device_advance(cpu, 0u);
    expect(state, cpu->io.pwm_master_counter[0] == 0u, "rising PWM sync");
    dspic33_write_word(cpu, 0x0c00u, 0x8280u);
    dspic33_pwm_sync(cpu, 0u, false, 0u);
    dspic33_device_advance(cpu, 0u);
    expect(state, cpu->io.pwm_master_counter[0] == 0u, "falling PWM sync");
    expect(state, !dspic33_pwm_sync(cpu, 2u, true, 0u), "reject PWM sync input");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0u, 15u, 15u, 0x0080u);
    enable_pwm(cpu, 0u);
    dspic33_write_word(cpu, 0x0c22u, 0xc201u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "synchronized override deferred");
    dspic33_device_advance(cpu, 15u);
    expect(state, dspic33_pwm_output(cpu, 0u, true),
           "synchronized override before boundary");
    dspic33_device_advance(cpu, 1u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "synchronized override at boundary");
    dspic33_write_word(cpu, 0x0c22u, 0xc001u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true),
           "synchronized override release deferred");
    dspic33_device_advance(cpu, 16u);
    expect(state, dspic33_pwm_output(cpu, 0u, true),
           "synchronized override release boundary");

