tylertms/dspic33e-sim/conformance/pwm.c
    dspic33_write_word(cpu, 0x0c22u, 0xc003u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "synchronized swap deferred");
    expect(state, !dspic33_pwm_output(cpu, 0u, false),
           "synchronized swap low deferred");
    dspic33_device_advance(cpu, 16u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "synchronized swap high");
    expect(state, dspic33_pwm_output(cpu, 0u, false), "synchronized swap low");

    dspic33_write_word(cpu, 0x0c22u, 0xc200u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "asynchronous override");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 31u, 1u, 0x0080u);
    enable_pwm(cpu, 0x0100u);
    expect(state, !dspic33_pwm_sync_output(cpu, 0u), "sync output idle");
    dspic33_device_advance(cpu, 32u);
    expect(state, dspic33_pwm_sync_output(cpu, 0u), "sync output pulse");
    dspic33_device_advance(cpu, 11u);
    expect(state, dspic33_pwm_sync_output(cpu, 0u), "sync output pulse width");
    dspic33_device_advance(cpu, 1u);
    expect(state, !dspic33_pwm_sync_output(cpu, 0u), "sync output pulse end");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 31u, 1u, 0x0080u);
    enable_pwm(cpu, 0x0300u);
    expect(state, dspic33_pwm_sync_output(cpu, 0u), "inverted sync output idle");
    dspic33_device_advance(cpu, 32u);
    expect(state, !dspic33_pwm_sync_output(cpu, 0u), "inverted sync output pulse");
    expect(state, !dspic33_pwm_sync_output(cpu, 2u), "reject sync output time base");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 31u, 1u, 0x0080u);
    enable_pwm(cpu, 0x0100u);
    dspic33_device_advance(cpu, 100u);
    expect(state, dspic33_pwm_sync_output(cpu, 0u), "batched sync output pulse");
    dspic33_device_advance(cpu, 8u);
    expect(state, !dspic33_pwm_sync_output(cpu, 0u), "batched sync output pulse end");
}

static void chop_and_power_cases(PwmConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 15u, 15u, 0x0080u);
    dspic33_write_word(cpu, 0x0c1au, 0x8003u);
    dspic33_write_word(cpu, 0x0c3eu, 2u);
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "chop initial output");
    dspic33_device_advance(cpu, 2u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "chop gated output");
    dspic33_device_advance(cpu, 2u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "chop repeated output");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 15u, 15u, 0x0080u);
    configure_generator(cpu, 1u, 0x0400u, 15u, 1u, 0x0080u);
    dspic33_write_word(cpu, 0x0c3eu, 0x000au);
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_output(cpu, 0u, true), "PWM source chop high");
    dspic33_device_advance(cpu, 2u);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "PWM source chop low");
    dspic33_write_word(cpu, 0x0c3eu, 0x001eu);
    expect(state, !dspic33_pwm_output(cpu, 0u, true), "reserved chop source low");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 15u, 7u, 0x0080u);
    enable_pwm(cpu, 0x2000u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_device_advance(cpu, 5u);
    expect(state, cpu->io.pwm_master_counter[0] == 0u, "PWM stops in idle");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_write_word(cpu, 0x0c00u, 0x8000u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_device_advance(cpu, 5u);
    expect(state, cpu->io.pwm_master_counter[0] == 5u, "PWM continues in idle");
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_device_advance(cpu, 5u);
    expect(state, cpu->io.pwm_master_counter[0] == 5u, "PWM stops in sleep");
}

static void boundary_cases(PwmConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized;
    expect(state, !dspic33_pwm_fault(cpu, DSPIC33_PWM_INPUT_COUNT, true, 0u),
           "reject PWM fault source");
    expect(state, !dspic33_pwm_current_limit(cpu, DSPIC33_PWM_INPUT_COUNT, true, 0u),
           "reject PWM current-limit source");
    expect(state, !dspic33_pwm_output(cpu, DSPIC33_PWM_COUNT, true),
           "reject PWM output generator");
    expect(state, !dspic33_pwm_dead_time(cpu, DSPIC33_PWM_COUNT, true, 0u),
           "reject PWM dead-time generator");

    dspic33_reset(cpu, 0u);
    configure_generator(cpu, 0u, 0x0400u, 15u, 7u, 0x0080u);
    enable_pwm(cpu, 0u);
    expect(state, dspic33_pwm_fault(cpu, 7u, true, 3u), "delayed PWM fault");
    dspic33_device_advance(cpu, 2u);
    expect(state, (cpu->io.pwm_fault_inputs & (1u << 7u)) == 0u,
           "PWM fault before delay");
    dspic33_device_advance(cpu, 1u);
    expect(state, (cpu->io.pwm_fault_inputs & (1u << 7u)) != 0u,
           "PWM fault after delay");

    initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize PWM copy");
    if (!initialized) {
        return;
    }
    expect(state, dspic33_copy(&copy, cpu), "copy PWM state");
    expect(state, copy.io.pwm_master_counter[0] == cpu->io.pwm_master_counter[0],
           "copy PWM counter");
    expect(state, copy.io.pwm_fault_inputs == cpu->io.pwm_fault_inputs,
           "copy PWM inputs");
    expect(state, copy.io.pwm[0] == cpu->io.pwm[0], "copy PWM output");
    dspic33_device_advance(cpu, 4u);
    dspic33_device_advance(&copy, 4u);
    expect(state, copy.io.pwm_master_counter[0] == cpu->io.pwm_master_counter[0],
           "advance copied PWM counter");
    dspic33_destroy(&copy);
}

int main(void) {
    Dspic33 cpu;
    PwmConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize PWM processor");
    if (!initialized) {
        fprintf(stderr, "cannot initialize PWM conformance simulator\n");
        return 1;
    }
    register_cases(&state, &cpu);
    clock_cases(&state, &cpu);
    mode_cases(&state, &cpu);
    duty_cases(&state, &cpu);
    dead_time_cases(&state, &cpu);
    b1_dead_time_cases(&state, &cpu);
    update_cases(&state, &cpu);
    b1_update_cases(&state, &cpu);
    trigger_cases(&state, &cpu);
    protection_cases(&state, &cpu);
    synchronization_cases(&state, &cpu);
    chop_and_power_cases(&state, &cpu);
    boundary_cases(&state, &cpu);
    printf("[pwm-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&cpu);
    return state.failed == 0u ? 0 : 1;
}
